/*********************************************************************************************************************
* 日期              作者                备注
* 2026-1-29       Mantou            base of all
********************************************************************************************************************/
#include "zf_common_headfile.h"
#pragma section all "cpu0_disarm"

// **************************** 代码区域 ****************************
int core0_main(void)
{
    clock_init();                   // 获取时钟频率<务必保留>
    debug_init();                   // 初始化默认调试串口
    // 此处编写用户代码 例如外设初始化代码等


    // 此处编写用户代码 例如外设初始化代码等
    cpu_wait_event_ready();         // 等待所有核心初始化完毕
	while (TRUE)
	{

	}
}

#pragma section all restore
// **************************** 代码区域 ****************************

